; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v6 ?v3)
             (pred_1 ?v13 ?v10)
             (pred_8 ?v6 ?v10)
             (pred_3 ?v7 ?v6 )
	     (pred_12 ?v6)
             (pred_7 ?v8)
             (pred_10 ?v13)
             (pred_9 ?v10)
             (pred_6 ?v6)
             (pred_11 ?v13)
             (pred_5 ?v6)
             (pred_4 ))



(:action op_2
:parameters (?v1 ?v4 ?v11 ?v2)
:precondition (and (pred_7 ?v1) (pred_7 ?v4) (pred_10 ?v11) (pred_9 ?v2)
          (pred_2 ?v1 ?v4) (pred_1 ?v11 ?v2)
                   (pred_8 ?v4 ?v2) (pred_12 ?v1) 
                   (pred_6 ?v4) (pred_11 ?v11))
:effect (and  (pred_5 ?v4) (not (pred_6 ?v4))))


(:action op_4
:parameters (?v1 ?v12)
:precondition (and (pred_7 ?v1) (pred_7 ?v12)
               (pred_12 ?v1) (pred_2 ?v1 ?v12) (pred_5 ?v12))
:effect (and (pred_12 ?v12) (not (pred_12 ?v1))))

(:action op_5
:parameters (?v1 ?v11)
:precondition (and (pred_7 ?v1) (pred_10 ?v11) 
                  (pred_12 ?v1) (pred_3 ?v11 ?v1) (pred_4 ))
:effect (and (pred_11 ?v11)
   (not (pred_3 ?v11 ?v1)) (not (pred_4 ))))


(:action op_1
:parameters (?v1 ?v9 ?v5)
:precondition (and (pred_7 ?v1) (pred_10 ?v9) (pred_10 ?v5)
                  (pred_12 ?v1) (pred_11 ?v5) (pred_3 ?v9 ?v1))
:effect (and (pred_11 ?v9) (pred_3 ?v5 ?v1)
        (not (pred_11 ?v5)) (not (pred_3 ?v9 ?v1))))

(:action op_3
:parameters (?v1 ?v11)
:precondition (and (pred_7 ?v1) (pred_10 ?v11) 
                  (pred_12 ?v1) (pred_11 ?v11))
:effect (and (pred_4 ) (pred_3 ?v11 ?v1) (not (pred_11 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_03 obj_08 obj_14 obj_09 obj_07 obj_13 obj_20 obj_15 obj_16 obj_11 obj_19 obj_10 obj_04 obj_12 obj_18
    obj_05 obj_02
    obj_17 obj_01
    )

    (:init
       (pred_4)

       (pred_7 obj_06)
       (pred_7 obj_03)
       (pred_7 obj_08)
       (pred_7 obj_14)
       (pred_7 obj_09)
       (pred_7 obj_07)
       (pred_7 obj_13)
       (pred_7 obj_20)
       (pred_7 obj_15)
       (pred_7 obj_16)
       (pred_7 obj_11)
       (pred_7 obj_19)
       (pred_7 obj_10)
       (pred_7 obj_04)
       (pred_7 obj_12)
       (pred_7 obj_18)
       (pred_9 obj_05)
       (pred_9 obj_02)
       (pred_10 obj_17)
       (pred_10 obj_01)

       (pred_2 obj_06 obj_09)
       (pred_2 obj_06 obj_03)
       (pred_2 obj_03 obj_07)
       (pred_2 obj_03 obj_08)
       (pred_2 obj_03 obj_06)
       (pred_2 obj_08 obj_13)
       (pred_2 obj_08 obj_14)
       (pred_2 obj_08 obj_03)
       (pred_2 obj_14 obj_20)
       (pred_2 obj_14 obj_08)
       (pred_2 obj_09 obj_15)
       (pred_2 obj_09 obj_07)
       (pred_2 obj_09 obj_06)
       (pred_2 obj_07 obj_16)
       (pred_2 obj_07 obj_13)
       (pred_2 obj_07 obj_03)
       (pred_2 obj_07 obj_09)
       (pred_2 obj_13 obj_11)
       (pred_2 obj_13 obj_20)
       (pred_2 obj_13 obj_08)
       (pred_2 obj_13 obj_07)
       (pred_2 obj_20 obj_19)
       (pred_2 obj_20 obj_14)
       (pred_2 obj_20 obj_13)
       (pred_2 obj_15 obj_10)
       (pred_2 obj_15 obj_16)
       (pred_2 obj_15 obj_09)
       (pred_2 obj_16 obj_04)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_16 obj_07)
       (pred_2 obj_16 obj_15)
       (pred_2 obj_11 obj_12)
       (pred_2 obj_11 obj_19)
       (pred_2 obj_11 obj_13)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_19 obj_20)
       (pred_2 obj_19 obj_11)
       (pred_2 obj_10 obj_04)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_04 obj_12)
       (pred_2 obj_04 obj_16)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_12 obj_18)
       (pred_2 obj_12 obj_11)
       (pred_2 obj_12 obj_04)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_18 obj_12)
       (pred_6 obj_07)
       (pred_6 obj_03)
       (pred_8  obj_07 obj_05)
       (pred_8  obj_03 obj_02)
       (pred_5 obj_06)
       (pred_5 obj_08)
       (pred_5 obj_14)
       (pred_5 obj_09)
       (pred_5 obj_13)
       (pred_5 obj_20)
       (pred_5 obj_15)
       (pred_5 obj_16)
       (pred_5 obj_11)
       (pred_5 obj_19)
       (pred_5 obj_10)
       (pred_5 obj_04)
       (pred_5 obj_12)
       (pred_5 obj_18)

       (pred_1  obj_17 obj_05)
       (pred_1  obj_01 obj_02)
       (pred_3 obj_17 obj_20)
       (pred_3 obj_01 obj_06)
       (pred_12 obj_14)
    )

    (:goal (and
       (pred_3 obj_01 obj_16)
    ))
(:constraints
  (always (not (pred_12 obj_11)))
)
)

; plan
1. (op_4 obj_14 obj_20)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_20)
   goals met: 0 of 1
2. (op_5 obj_20 obj_17)
   deleted: (pred_3 obj_17 obj_20) (pred_4)
   added: (pred_11 obj_17)
   goals met: 0 of 1
3. (op_4 obj_20 obj_13)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_13)
   goals met: 0 of 1
4. (op_2 obj_13 obj_07 obj_17 obj_05)
   deleted: (pred_6 obj_07)
   added: (pred_5 obj_07)
   goals met: 0 of 1
5. (op_4 obj_13 obj_07)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_07)
   goals met: 0 of 1
6. (op_4 obj_07 obj_09)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_09)
   goals met: 0 of 1
7. (op_4 obj_09 obj_06)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_06)
   goals met: 0 of 1
8. (op_1 obj_06 obj_01 obj_17)
   deleted: (pred_11 obj_17) (pred_3 obj_01 obj_06)
   added: (pred_11 obj_01) (pred_3 obj_17 obj_06)
   goals met: 0 of 1
9. (op_4 obj_06 obj_09)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_09)
   goals met: 0 of 1
10. (op_4 obj_09 obj_07)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_07)
   goals met: 0 of 1
11. (op_4 obj_07 obj_16)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_16)
   goals met: 0 of 1
12. (op_3 obj_16 obj_01)
   deleted: (pred_11 obj_01)
   added: (pred_4) (pred_3 obj_01 obj_16)
   goals met: 1 of 1
